namespace Lessons
{
    public class GameobjectsComponents5
    {
    }
    // когда подходит компонентный подход и когда нет и нужно ООП
    // ООП
    //  напишем фасад (англ. Facade) для Character (интерфейс к сложной системе классов) еще есть Enemy
    // через него с помощью событий мы сможем вызывать и получить доступ к методам и полям нашего героя
    // мы оборачиваем все методами свойствами и ивентами
    // реализуем контроллер для взаимодействия MoveControlle, взаимодействие будет реализовано через нашу обертку Character
    //CharacterMoveController добавляем на объект на сцене Controller
    
    
    
    
}